#coding=gbk
#邀请一些人共进晚餐
受邀请人=['爷爷','奶奶','姑姑','叔叔']
print("向"+受邀请人[0]+","+受邀请人[1]+","+受邀请人[-2]+","+受邀请人[-1]+";"+"发出晚餐宴会邀请")


受邀请人[0]='女票'
print("向"+受邀请人[0]+","+受邀请人[1]+","+受邀请人[-2]+","+受邀请人[-1]+";"+"发出晚餐宴会邀请")

受邀请人.insert(0,'基友')
受邀请人.insert(2,'同学')
受邀请人.append('老师')
print(受邀请人)

print("向"+受邀请人[0]+受邀请人[1]+受邀请人[2]+受邀请人[3]+受邀请人[-3]+受邀请人[-2]+受邀请人[-1]+"发出晚餐宴会邀请")

print("向"+受邀请人[0]+","+受邀请人[1]+";"+"发出晚餐宴会邀请")
n_1=受邀请人.pop()
n_2=受邀请人.pop()
n_3=受邀请人.pop()
n_4=受邀请人.pop()
n_5=受邀请人.pop()
print("下次吧,"+n_1)
print("下次吧,"+n_2)
print("下次吧,"+n_3)
print("下次吧,"+n_4)
print("下次吧,"+n_5)

print("继续邀请"+受邀请人[0])
print("继续邀请"+受邀请人[1])

del 受邀请人[0]
del 受邀请人[1]
print(受邀请人)
